<!-- terraform cdk action for options with hash 2e679e3a099220b46f78aa91824ccd10 -->
### ✅ Successfully applied Terraform CDK Stack 'cloudwatch_alarm'



<details><summary>Show Run</summary>

```shell
(node:2331) [DEP0040] DeprecationWarning: The `punycode` module is deprecated. Please use a userland alternative instead.
(Use `node --trace-deprecation ...` to show where the warning was created)
cloudwatch_alarm  Initializing the backend...
cloudwatch_alarm  Initializing modules...
cloudwatch_alarm  Initializing provider plugins...
cloudwatch_alarm  - Reusing previous version of hashicorp/aws from the dependency lock file
cloudwatch_alarm  - Using previously-installed hashicorp/aws v5.65.0

                  Terraform has been successfully initialized!

                  You may now begin working with Terraform. Try running "terraform plan" to see
                  any changes that are required for your infrastructure. All Terraform commands
                  should now work.

                  If you ever set or change modules or backend configuration for Terraform,
                  rerun this command to reinitialize your working directory. If you forget, other
                  commands will detect it and remind you to do so if necessary.
cloudwatch_alarm  data.aws_caller_identity.current (current): Reading...
cloudwatch_alarm  aws_iam_role.alert-to-slack (alert-to-slack): Refreshing state... [id=alert-to-slack]
                  module.ec2_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0]: Refreshing state... [id=ec2_Maximum_alarm_CPUUtilization]
                  aws_sns_topic.ToSlack (ToSlack): Refreshing state... [id=arn:aws:sns:ap-northeast-1:931240111674:AlertToSlack]
cloudwatch_alarm  data.aws_caller_identity.current (current): Read complete after 0s [id=931240111674]
cloudwatch_alarm  aws_cloudformation_stack.chatbot (chatbot): Refreshing state... [id=arn:aws:cloudformation:ap-northeast-1:931240111674:stack/cloudformation-chatbot/7b365410-77c7-11ef-af43-0acbd062bd13]
cloudwatch_alarm  data.aws_iam_policy_document.sns_topic_policy (sns_topic_policy): Reading...
cloudwatch_alarm  data.aws_iam_policy_document.sns_topic_policy (sns_topic_policy): Read complete after 0s [id=1743289387]
                  aws_sns_topic_policy.snsPolicy (snsPolicy): Refreshing state... [id=arn:aws:sns:ap-northeast-1:931240111674:AlertToSlack]
cloudwatch_alarm  Terraform used the selected providers to generate the following execution plan.
                  Resource actions are indicated with the following symbols:
                    + create
                    - destroy

                  Terraform will perform the following actions:
cloudwatch_alarm  # module.ec2_A_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0] will be created
                    + resource "aws_cloudwatch_metric_alarm" "this" {
                        + actions_enabled                       = true
                        + alarm_actions                         = [
                            + "arn:aws:sns:ap-northeast-1:931240111674:AlertToSlack",
                          ]
                        + alarm_description                     = "This metric monitors Maximum CPUUtilization"
                        + alarm_name                            = "ec2_A_Maximum_alarm_CPUUtilization"
                        + arn                                   = (known after apply)
                        + comparison_operator                   = "GreaterThanThreshold"
                        + dimensions                            = {
                            + "InstanceId" = "i-XXXXXXXXXX"
                          }
                        + evaluate_low_sample_count_percentiles = (known after apply)
                        + evaluation_periods                    = 6
                        + id                                    = (known after apply)
                        + metric_name                           = "CPUUtilization"
                        + namespace                             = "AWS/EC2"
                        + period                                = 300
                        + statistic                             = "Maximum"
                        + tags_all                              = {
                            + "IaC"         = "cdktf"
                            + "environment" = "cloudwatch_alarm"
                          }
                        + threshold                             = 90
                        + treat_missing_data                    = "missing"
                      }

                    # module.ec2_B_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0] will be created
                    + resource "aws_cloudwatch_metric_alarm" "this" {
                        + actions_enabled                       = true
                        + alarm_actions                         = [
                            + "arn:aws:sns:ap-northeast-1:931240111674:AlertToSlack",
                          ]
                        + alarm_description                     = "This metric monitors Maximum CPUUtilization"
                        + alarm_name                            = "ec2_B_Maximum_alarm_CPUUtilization"
                        + arn                                   = (known after apply)
                        + comparison_operator                   = "GreaterThanThreshold"
                        + dimensions                            = {
                            + "InstanceId" = "i-XXXXXXXXXX"
                          }
                        + evaluate_low_sample_count_percentiles = (known after apply)
                        + evaluation_periods                    = 6
                        + id                                    = (known after apply)
                        + metric_name                           = "CPUUtilization"
                        + namespace                             = "AWS/EC2"
                        + period                                = 300
                        + statistic                             = "Maximum"
                        + tags_all                              = {
                            + "IaC"         = "cdktf"
                            + "environment" = "cloudwatch_alarm"
                          }
                        + threshold                             = 90
                        + treat_missing_data                    = "missing"
                      }

                    # module.ec2_C_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0] will be created
                    + resource "aws_cloudwatch_metric_alarm" "this" {
                        + actions_enabled                       = true
                        + alarm_actions                         = [
                            + "arn:aws:sns:ap-northeast-1:931240111674:AlertToSlack",
                          ]
                        + alarm_description                     = "This metric monitors Maximum CPUUtilization"
                        + alarm_name                            = "ec2_C_Maximum_alarm_CPUUtilization"
                        + arn                                   = (known after apply)
                        + comparison_operator                   = "GreaterThanThreshold"
                        + dimensions                            = {
                            + "InstanceId" = "i-XXXXXXXXXX"
                          }
                        + evaluate_low_sample_count_percentiles = (known after apply)
                        + evaluation_periods                    = 6
                        + id                                    = (known after apply)
                        + metric_name                           = "CPUUtilization"
                        + namespace                             = "AWS/EC2"
                        + period                                = 300
cloudwatch_alarm  + statistic                             = "Maximum"
                        + tags_all                              = {
                            + "IaC"         = "cdktf"
                            + "environment" = "cloudwatch_alarm"
                          }
                        + threshold                             = 90
                        + treat_missing_data                    = "missing"
                      }

                    # module.ec2_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0] will be destroyed
                    # (because aws_cloudwatch_metric_alarm.this is not in configuration)
                    - resource "aws_cloudwatch_metric_alarm" "this" {
                        - actions_enabled                       = true -> null
                        - alarm_actions                         = [
                            - "arn:aws:sns:ap-northeast-1:931240111674:AlertToSlack",
                          ] -> null
                        - alarm_description                     = "This metric monitors Maximum CPUUtilization" -> null
                        - alarm_name                            = "ec2_Maximum_alarm_CPUUtilization" -> null
                        - arn                                   = "arn:aws:cloudwatch:ap-northeast-1:931240111674:alarm:ec2_Maximum_alarm_CPUUtilization" -> null
                        - comparison_operator                   = "GreaterThanThreshold" -> null
                        - datapoints_to_alarm                   = 0 -> null
                        - dimensions                            = {
                            - "InstanceId" = "i-XXXXXXXXXX"
                          } -> null
                        - evaluation_periods                    = 6 -> null
                        - id                                    = "ec2_Maximum_alarm_CPUUtilization" -> null
                        - insufficient_data_actions             = [] -> null
                        - metric_name                           = "CPUUtilization" -> null
                        - namespace                             = "AWS/EC2" -> null
                        - ok_actions                            = [] -> null
                        - period                                = 300 -> null
                        - statistic                             = "Maximum" -> null
                        - tags                                  = {} -> null
                        - tags_all                              = {
                            - "IaC"         = "cdktf"
                            - "environment" = "cloudwatch_alarm"
                          } -> null
                        - threshold                             = 90 -> null
                        - treat_missing_data                    = "missing" -> null
                          # (4 unchanged attributes hidden)
                      }

                  Plan: 3 to add, 0 to change, 1 to destroy.
cloudwatch_alarm  module.ec2_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0]: Destroying... [id=ec2_Maximum_alarm_CPUUtilization]
cloudwatch_alarm  module.ec2_C_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0]: Creating...
cloudwatch_alarm  module.ec2_B_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0]: Creating...
                  module.ec2_A_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0]: Creating...
cloudwatch_alarm  module.ec2_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0]: Destruction complete after 1s
cloudwatch_alarm  module.ec2_A_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0]: Creation complete after 1s [id=ec2_A_Maximum_alarm_CPUUtilization]
cloudwatch_alarm  module.ec2_C_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0]: Creation complete after 1s [id=ec2_C_Maximum_alarm_CPUUtilization]
cloudwatch_alarm  module.ec2_B_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0]: Creation complete after 1s [id=ec2_B_Maximum_alarm_CPUUtilization]
cloudwatch_alarm  Apply complete! Resources: 3 added, 0 changed, 1 destroyed.

No outputs found.

```

</details>